# St7SetInfluenceMaxVariableState

Sets the enabled state of the specified single-variable maximum load influence combination.

long St7SetInfluenceMaxVariableState(long uID, long MaxVariableID, bool Enabled)
Input Parameters
uID
Strand7 model file ID.
MaxVariableID
ID of the load influence variable.
Enabled
True to enable the variable.